app/controllers/chatrooms_controller.rb

  def index
    @chatroom = Chatroom.new
    @chatrooms = Chatroom.all
---
SELECT "chatrooms".* FROM "chatrooms"

  def create
    @chatroom = Chatroom.new(chatroom_params)
    if @chatroom.save
---
INSERT INTO "chatrooms" ("topic", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4) RETURNING "id"  [["topic", "futsal"], ["created_at", 2017-06-14 19:02:47 UTC], ["updated_at", 2017-06-14 19:02:47 UTC], ["slug", "futsal"]]

  def show
    @chatroom = Chatroom.find_by(slug: params[:slug])
---
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."slug" = $1 LIMIT $2  [["slug", "futsal"], ["LIMIT", 1]]