app/controllers/messages_controller.rb

  def create
    message = Message.new(message_params)
    message.user = current_user

    if message.save
---
INSERT INTO "messages" ("content", "user_id", "chatroom_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hello"], ["user_id", 1], ["chatroom_id", 1], ["created_at", 2017-06-14 19:03:01 UTC], ["updated_at", 2017-06-14 19:03:01 UTC]]